#################### 算术运算符：+ - * / // % ** #####################
print("10 + 4 = ", 10 + 4) # 加
print("10 - 4 = ", 10 - 4) # 减
print("10 * 4 = ", 10 * 4) # 乘
print("10 / 4 = ", 10 / 4) # 除 - 2.5
print("10 // 4 = ", 10 // 4) # 取整（结果为整数）- 2
print("10 % 4 = ", 10 % 4) # 取余/求模 - 2
print("10 ** 4 = ", 10 ** 4) # 幂指数，10的 4 次方 - 10000

# 算术运算符的优先级 ---> ** ---> * / // % ---> + -
print("0.1 + 10 / 4**2 = ", 0.1 + 10 / 4**2)

# 案例：输入x和y,计算 x + y ,x - y 的结果并输出
x = float(input("请输入 x 的值："))
y = float(input("请输入 y 的值："))


# 0.9999999999 --->精度损失；由于计算机底层是基于 二进制 进行数据的存储与处理，二进制是无法准确的表示所有的小数的，因此涉及到浮点数的运算可能会损失精度
print(f"x + y = {x + y}, x - y = {x - y}")

#################### 赋值运算符 = += -= *= /= //= %= **=####################
# 初始值 num = 85
num = 85

num += 10  # num = num + 10
print("num += 10 后, num = ", num)  # 95

num -= 10  # num = num - 10
print("num -= 10 后, num = ", num)  # 85

num *= 10  # num = num * 10
print("num *= 10 后, num = ", num)  # 850

num /= 10  # num = num / 10
print("num /= 10 后, num = ", num)  # 85.0

num //= 10 # num = num // 10
print("num //= 10 后, num = ", num) # 8.0

num %= 3   # num = num % 3
print("num %= 3 后, num = ", num)  # 2.0

num **= 3  # num = num ** 3
print("num **= 3 后, num = ", num)  # 8.0

#################### 比较运算符 == != > >= < <= ,比较运算符的结果是布尔值 ####################

#################### 逻辑运算符：and or not ####################

# 案例 1：键盘输入一个整数，判断这个数字是否在 10～20之间 --->在：True，不在：False
n = int(input("请输入一个整数:"))

print(f"{n} 在10～20之间:",n >= 10 and n <= 20)

# 案例 2：键盘输入一个整数，判断这个数字是否不在 10～20之间
n = int(input("请输入一个整数:"))

print(f"{n} 不在10～20之间:",n < 10 or n > 20)
